import streamlit as st

st.title("TRA CỨU THAM KHẢO KẾT QUẢ TUYỂN SINH NĂM 2025")

subject = st.selectbox("Chọn môn V-SAT/ĐGNL-ĐHQG TP. Hồ Chí Minh", ["Toán_VSAT", "Vật lí_VSAT", "Hóa học_VSAT", "Sinh học_VSAT", "Lịch sử_VSAT", "Địa lí_VSAT", "Tiếng Anh_VSAT", "Ngữ văn_VSAT", "ĐGNL – ĐHQG TP. Hồ Chí Minh"])
#diem_vsat = st.number_input("👉 Nhập điểm V-SAT:", min_value=0.0, max_value=150.0, step=0.1)

if subject == "ĐGNL – ĐHQG TP. Hồ Chí Minh":
    diem = st.number_input("👉 Nhập điểm ĐGNL ĐHQG TP. Hồ Chí Minh (0–1200):", min_value=0, max_value=1200, step=1)
else:
    diem = st.number_input("👉 Nhập điểm V-SAT (0–150):", min_value=0.0, max_value=150.0, step=0.1)

data_toan = [
    {"a": 132, "b": 150, "c": 8.5, "d": 10},
    {"a": 128.5, "b": 132, "c": 8.1, "d": 8.5},
    {"a": 122.5, "b": 128.5, "c": 7.75, "d": 8.1},
    {"a": 114.5, "b": 122.5, "c": 7.0, "d": 7.75},
    {"a": 108, "b": 114.5, "c": 6.6, "d": 7.0},
    {"a": 102.5, "b": 108, "c": 6.25, "d": 6.6},
    {"a": 97, "b": 102.5, "c": 6.0, "d": 6.25},
    {"a": 91, "b": 97, "c": 5.6, "d": 6.0},
    {"a": 85, "b": 91, "c": 5.25, "d": 5.6},
    {"a": 77, "b": 85, "c": 5.0, "d": 5.25},
    {"a": 68, "b": 77, "c": 4.5, "d": 5.0},
    {"a": 6, "b": 68, "c": 1.5, "d": 4.5},
]

data_vatli = [
    {"a": 123, "b": 147, "c": 9.5, "d": 10},
    {"a": 118.5, "b": 123, "c": 9.25, "d": 9.5},
    {"a": 112.5, "b": 118.5, "c": 9.0, "d": 9.25},
    {"a": 105, "b": 112.5, "c": 8.5, "d": 9.0},
    {"a": 99.5, "b": 105, "c": 8, "d": 8.5},
    {"a": 94.5, "b": 99.5, "c": 7.75, "d": 8},
    {"a": 90, "b": 94.5, "c": 7.5, "d": 7.75},
    {"a": 85, "b": 90, "c": 7.25, "d": 7.5},
    {"a": 80, "b": 85, "c": 6.75, "d": 7.25},
    {"a": 74, "b": 80, "c": 6.35, "d": 6.75},
    {"a": 66.5, "b": 74, "c": 5.75, "d": 6.35},
    {"a": 17, "b": 66.5, "c": 3.05, "d": 5.75},
]

data_hoahoc = [
    {"a": 129, "b": 150, "c": 9.5, "d": 10},
    {"a": 124.5, "b": 129, "c": 9.25, "d": 9.5},
    {"a": 117, "b": 124.5, "c": 8.75, "d": 9.25},
    {"a": 107.5, "b": 117, "c": 8.25, "d": 8.75},
    {"a": 100.5, "b": 107.5, "c": 7.75, "d": 8.25},
    {"a": 94, "b": 100.5, "c": 7.25, "d": 7.75},
    {"a": 88, "b": 94, "c": 6.75, "d": 7.25},
    {"a": 81.5, "b": 88, "c": 6.25, "d": 6.75},
    {"a": 75.5, "b": 81.5, "c": 5.75, "d": 6.25},
    {"a": 68.5, "b": 75.5, "c": 5.25, "d": 5.75},
    {"a": 59.5, "b": 68.5, "c": 4.6, "d": 5.25},
    {"a": 20, "b": 59.5, "c": 1.35, "d": 4.6},
]

data_sinhhoc = [
    {"a": 130.5, "b": 150, "c": 9, "d": 9.75},
    {"a": 126.5, "b": 130.5, "c": 8.75, "d": 9},
    {"a": 120.5, "b": 126.5, "c": 8.34, "d": 8.75},
    {"a": 112.5, "b": 120.5, "c": 7.85, "d": 8.34},
    {"a": 105.5, "b": 112.5, "c": 7.5, "d": 7.85},
    {"a": 100, "b": 105.5, "c": 7.25, "d": 7.5},
    {"a": 94.5, "b": 100, "c": 6.85, "d": 7.25},
    {"a": 88.5, "b": 94.5, "c": 6.5, "d": 6.85},
    {"a": 82.5, "b": 88.5, "c": 6.25, "d": 6.5},
    {"a": 76, "b": 82.5, "c": 5.85, "d": 6.25},
    {"a": 66.5, "b": 76, "c": 5.25, "d": 5.85},
    {"a": 26.5, "b": 66.5, "c": 2.8, "d": 5.25},
]

data_lichsu = [
    {"a": 133.5, "b": 150, "c": 9.75, "d": 10},
    {"a": 131.0, "b": 133.5, "c": 9.5, "d": 9.75},
    {"a": 126.5, "b": 131.0, "c": 9.25, "d": 9.5},
    {"a": 120.5, "b": 126.5, "c": 9, "d": 9.25},
    {"a": 115, "b": 120.5, "c": 8.5, "d": 9},
    {"a": 110, "b": 115.0, "c": 8.25, "d": 8.5},
    {"a": 105.5, "b": 110, "c": 8, "d": 8.25},
    {"a": 101.0, "b": 105.5, "c": 7.75, "d": 8},
    {"a": 95.5, "b": 101, "c": 7.5, "d": 7.75},
    {"a": 88.5, "b": 95.5, "c": 7, "d": 7.5},
    {"a": 79.5, "b": 88.5, "c": 6.35, "d": 7},
    {"a": 36.5, "b": 79.5, "c": 2.95, "d": 6.35},
]

data_diali = [
    {"a": 124, "b": 141, "c": 10, "d": 10},
    {"a": 120.5, "b": 124, "c": 10, "d": 10},
    {"a": 115.5, "b": 120.5, "c": 9.75, "d": 10},
    {"a": 108.5, "b": 115.5, "c": 9.25, "d": 9.75},
    {"a": 103, "b": 108.5, "c": 9, "d": 9.25},
    {"a": 98.5, "b": 103, "c": 8.75, "d": 9},
    {"a": 94, "b": 98.5, "c": 8.5, "d": 8.75},
    {"a": 89.5, "b": 94, "c": 8.25, "d": 8.5},
    {"a": 84.5, "b": 89.5, "c": 7.75, "d": 8.25},
    {"a": 79, "b": 84.5, "c": 7.25, "d": 7.75},
    {"a": 71, "b": 79, "c": 6.5, "d": 7.25},
    {"a": 31, "b": 71, "c": 3, "d": 6.5},
]

data_tienganh = [
    {"a": 131, "b": 150, "c": 7.75, "d": 9.75},
    {"a": 127.5, "b": 131, "c": 7.5, "d": 7.75},
    {"a": 120.5, "b": 127.5, "c": 7, "d": 7.5},
    {"a": 112.0, "b": 120.5, "c": 6.5, "d": 7},
    {"a": 105, "b": 112, "c": 6, "d": 6.5},
    {"a": 98.5, "b": 105, "c": 5.75, "d": 6},
    {"a": 92, "b": 98.5, "c": 5.5, "d": 5.75},
    {"a": 85.5, "b": 92, "c": 5.25, "d": 5.5},
    {"a": 78.5, "b": 85.5, "c": 5, "d": 5.25},
    {"a": 70.5, "b": 78.5, "c": 4.5, "d": 5},
    {"a": 60, "b": 70.5, "c": 4, "d": 4.5},
    {"a": 20.5, "b": 60, "c": 1.25, "d": 4},
]

data_nguvan = [
    {"a": 129.5, "b": 146, "c": 9.25, "d": 9.75},
    {"a": 127.5, "b": 129.5, "c": 9.0, "d": 9.25},
    {"a": 124.0, "b": 127.5, "c": 9.0, "d": 9.0},
    {"a": 119.5, "b": 124.0, "c": 8.75, "d": 9},
    {"a": 115.5, "b": 119.5, "c": 8.5, "d": 8.75},
    {"a": 112.5, "b": 115.5, "c": 8.25, "d": 8.5},
    {"a": 109, "b": 112.5, "c": 8, "d": 8.25},
    {"a": 106, "b": 109, "c": 7.75, "d": 8.0},
    {"a": 102, "b": 106, "c": 7.5, "d": 7.75},
    {"a": 97, "b": 102, "c": 7.25, "d": 7.5},
    {"a": 90, "b": 97, "c": 6.75, "d": 7.25},
    {"a": 5, "b": 90, "c": 3.5, "d": 6.75},
]

data_DGNL = [
    {"a": 958, "b": 1122, "c": 27, "d": 30},
    {"a": 932, "b": 958, "c": 26, "d": 27},
    {"a": 886, "b": 932, "c": 24.5, "d": 26.0},
    {"a": 815, "b": 886, "c": 22.35, "d": 24.5},
    {"a": 755, "b": 815, "c": 20.5, "d": 22.35},
    {"a": 701, "b": 755, "c": 19, "d": 20.5},
    {"a": 652, "b": 701, "c": 17.6, "d": 19},
    {"a": 605, "b": 652, "c": 16.25, "d": 17.6},
    {"a": 560, "b": 605, "c": 14.8, "d": 16.25},
    {"a": 514, "b": 560, "c": 13.2, "d": 14.8},
    {"a": 458, "b": 514, "c": 11.15, "d": 13.2},
    {"a": 0, "b": 458, "c": 0, "d": 11.15},
]

def quy_doi(x, data):
    for row in data:
        a, b, c, d = row["a"], row["b"], row["c"], row["d"]
        if a < x <= b:
            y = c + ((x - a) / (b - a)) * (d - c)
            return round(y, 2)
    return "Không thuộc khoảng nào"

if diem > 0:
    if subject == "Toán_VSAT":
        result = quy_doi(diem, data_toan)
        st.success(f"✅ Điểm quy đổi Toán THPT tương đương: {result}")
    elif subject == "Vật lí_VSAT":
        result = quy_doi(diem, data_vatli)
        st.success(f"✅ Điểm quy đổi Vật lí THPT tương đương: {result}")
    elif subject == "Hóa học_VSAT":
        result = quy_doi(diem, data_hoahoc)
        st.success(f"✅ Điểm quy đổi Hóa học THPT tương đương: {result}")
    elif subject == "Sinh học_VSAT":
        result = quy_doi(diem, data_sinhhoc)
        st.success(f"✅ Điểm quy đổi Sinh học THPT tương đương: {result}")
    elif subject == "Lịch sử_VSAT":
        result = quy_doi(diem, data_lichsu)
        st.success(f"✅ Điểm quy đổi Lịch sử THPT tương đương: {result}")
    elif subject == "Địa lí_VSAT":
        result = quy_doi(diem, data_diali)
        st.success(f"✅ Điểm quy đổi Địa lí THPT tương đương: {result}")
    elif subject == "Tiếng Anh_VSAT":
        result = quy_doi(diem, data_tienganh)
        st.success(f"✅ Điểm quy đổi Tiếng Anh THPT tương đương: {result}")
    elif subject == "Ngữ văn_VSAT":
        result = quy_doi(diem, data_nguvan)
        st.success(f"✅ Điểm quy đổi Ngữ văn THPT tương đương: {result}")
    elif subject == "ĐGNL – ĐHQG TP. Hồ Chí Minh":
        result = quy_doi(diem, data_DGNL)
        st.success(f"✅ Điểm quy đổi THPT tương đương: {result}")
